; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	image1 - mode
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Phenomenon5 image1)
	(have_image Planet6 image1)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 image1)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 image1)
	(have_image Planet12 infrared0)
	(have_image Phenomenon13 image1)
	(have_image Planet14 infrared0)
	(have_image Star15 infrared0)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared0)
	(have_image Phenomenon18 infrared0)
	(have_image Phenomenon19 infrared0)
	(have_image Phenomenon20 image1)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 16
2. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 16
3. (turn_to satellite0 phenomenon18 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 16
4. (take_image satellite0 phenomenon18 instrument2 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 1 of 16
5. (turn_to satellite0 phenomenon17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 16
6. (take_image satellite0 phenomenon17 instrument2 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 2 of 16
7. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 16
8. (take_image satellite0 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 16
9. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 16
10. (take_image satellite0 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 16
11. (turn_to satellite0 phenomenon19 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon19)
   goals met: 4 of 16
12. (take_image satellite0 phenomenon19 instrument2 infrared0)
   added: (have_image phenomenon19 infrared0)
   goals met: 5 of 16
13. (turn_to satellite0 phenomenon20 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon20)
   goals met: 5 of 16
14. (take_image satellite0 phenomenon20 instrument2 image1)
   added: (have_image phenomenon20 image1)
   goals met: 6 of 16
15. (turn_to satellite0 phenomenon5 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon5)
   goals met: 6 of 16
16. (take_image satellite0 phenomenon5 instrument2 image1)
   added: (have_image phenomenon5 image1)
   goals met: 7 of 16
17. (turn_to satellite0 phenomenon8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon8)
   goals met: 7 of 16
18. (take_image satellite0 phenomenon8 instrument2 image1)
   added: (have_image phenomenon8 image1)
   goals met: 8 of 16
19. (turn_to satellite0 planet12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet12)
   goals met: 8 of 16
20. (take_image satellite0 planet12 instrument2 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 9 of 16
21. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 9 of 16
22. (take_image satellite0 planet14 instrument2 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 10 of 16
23. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 10 of 16
24. (take_image satellite0 planet16 instrument2 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 11 of 16
25. (turn_to satellite0 planet6 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet6)
   goals met: 11 of 16
26. (take_image satellite0 planet6 instrument2 image1)
   added: (have_image planet6 image1)
   goals met: 12 of 16
27. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 12 of 16
28. (take_image satellite0 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 13 of 16
29. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 13 of 16
30. (take_image satellite0 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 14 of 16
31. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 14 of 16
32. (take_image satellite0 star15 instrument2 infrared0)
   added: (have_image star15 infrared0)
   goals met: 15 of 16
33. (turn_to satellite0 star7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star7)
   goals met: 15 of 16
34. (take_image satellite0 star7 instrument2 infrared0)
   added: (have_image star7 infrared0)
   goals met: 16 of 16
